# Working with Data in Python
### Learning Objectives
In this lesson you will learn about:
1. Reading files with open
2. Writing files with open
3. Loading data with Pandas
4. Working with and Saving data with Pandas

## 1. Reading files with open

In [45]:
# Opening a File

file1 = open(r'C:\Users\Tanmoy\Desktop\tata.txt','r')
file1.read() # Displays whats inside the file
file1.name   # Name of the file
file1.mode   # Mode of the file Output 'r'
file1.close()
print(file1.closed)

True

In [104]:
# Using with statement helps to automatically closes the file

with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'r') as file2:
    file_stuff = file2.readlines(1) # New lines are assinged in array used for multiple lines
    print(file_stuff)

with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'r') as file3:
    file_stuff3 = file3.readline(1) # read the first line of the file
    print(file_stuff3)

['asd\n']
a

In [101]:
with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'r') as file4:
    for i in file4:
        print(i)

asd

asd

asd

asd

asd

asd

asdahsfkahsd

## 2. Writing files with open

In [130]:
# Write in a file

file2 = open(r'C:\Users\Tanmoy\Desktop\tata.txt','w')
file2.write('tanmoy')
file7 = open(r'C:\Users\Tanmoy\Desktop\tata.txt','r')
file7.read()

'tanmoy'

In [144]:
with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'w') as file6:
    file6.write('tanmoy2\n')
    file6.write('tanmoy3\n')
    file6.write('tanmoy4\n')
    file6.write('tanmoy5\n')
with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'r') as file6:
    file6.read()
with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'w') as file7:
    for i in range(1,10):
        file7.write('i\n')

In [148]:
# Print the lists in a file

lists1 = ['tanmoy','badamtala','palta']
with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'w') as file8:
    for i in lists1:
        file8.write(i)
        file8.write('\n')

In [150]:
# Copy one file to the other file

with open(r"C:\\Users\\Tanmoy\\Desktop\\tata.txt",'r') as file9:
    with open(r"C:\\Users\\Tanmoy\\Desktop\\tata2.txt",'w') as file10:
        for i in file9:
            file10.write(i)

## 3. Loading data with Pandas

In [190]:
# importing pandas

import pandas as pd
import sys

In [174]:
# read csv file 

df = pd.read_csv(r'C:\Users\Tanmoy\Desktop\datasci\Toyota.csv')
df.head(10)

# read excel file pd.read_excel

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
5,5,12950,32.0,61000,Diesel,90,0.0,0,2000,3,1170
6,6,16900,27.0,??,Diesel,????,NaN,0,2000,3,1245
7,7,18600,30.0,75889,NaN,90,1.0,0,2000,3,1245
8,8,21500,27.0,19700,Petrol,192,0.0,0,1800,3,1185
9,9,12950,23.0,71138,Diesel,????,NaN,0,1900,3,1105

In [165]:
songs = {'Name':['tanmoy','munshi','badamtala','Palta'],'PIN':[782131,21341,214124,14231],'Alpha':['00:12','09:32','09:45','91:83']}
songs_df = pd.DataFrame(songs)
songs_df.head()

        Name     PIN  Alpha
0     tanmoy  782131  00:12
1     munshi   21341  09:32
2  badamtala  214124  09:45
3      Palta   14231  91:83

In [166]:
# Selecting columns from df1

Name = songs_df['Name']

In [178]:
df['Price']

# Selecting personalized df from existing df

df3 = df[['Price','HP','Age']]
df3.head(100)

    Price   HP   Age
0   13500   90  23.0
1   13750   90  23.0
2   13950   90  24.0
3   14950   90  26.0
4   13750   90  30.0
..    ...  ...   ...
95  19950   90  17.0
96  15950   97  19.0
97  15950   97  19.0
98  18750  110  11.0
99  17450   97  18.0

[100 rows x 3 columns]

In [192]:
#Access unique elements 'ix'

df3.ix[67,2]
df3.ix[67,'HP']

# Slicing of df
df.ix[0:2,0:3]

C:\Users\Tanmoy\AppData\Roaming\Python\Python36\site-packages\ipykernel_launcher.py:3: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Tanmoy\AppData\Roaming\Python\Python36\site-packages\ipykernel_launcher.py:4: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.
C:\Users\Tanmoy\AppData\Roaming\Python\Python36\site-packages\ipykernel_launcher.py:7: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  import sys

   Unnamed: 0  Price   Age
0           0  13500  23.0
1           1  13750  23.0
2           2  13950  24.0

In [194]:
#Same as above

df3.iloc[67,2]

C:\Users\Tanmoy\AppData\Roaming\Python\Python36\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

22.0